/*
	Написати функцію яка поверне всі трьохзначні "спеціальні" числа.
	Число називається спеціальним якщо воно дорівнює сумі кубів своїх цифр,
	наприклад 371 - спеціальне число, тому що 371 = 3^3 + 7^3 + 1^3
	Вхідні дані: відсутні
	Результат: масив що містить всі трьохзначні "спеціальні" числа
    приклад в specialNumbers.test.js
*/

var solution = function() {
	var arr2 = [];
for (var i=100; i<=999; i++){
		
	var arr = i.toString().split('')
 		if(Math.pow(arr[0]*1, 3) + Math.pow(arr[1]*1, 3) + Math.pow(arr[2]*1, 3) == i){
    arr2.push(i);
    }
      
 }  return arr2; 
};

module.exports = solution;